powermax_threads20_result_200508/thread_20_nvm_sr_3400_4.txt
shm_addr = 7000
shm_addr = 7000
shm_addr = 7000
[...]
======================================
 all_ops == 2000000
 test_time == 18.387704
 Throughput == 108768.337798
 ======================================
20        Threads
1         Connections per thread
100000    Requests per client


ALL STATS
=========================================================================
Type         Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
-------------------------------------------------------------------------
Sets            0.00          ---          ---      0.00000         0.00 
Gets       108516.64    108516.64         0.00      0.18000    113167.55 
Waits           0.00          ---          ---      0.00000          --- 
Totals     108516.64    108516.64         0.00      0.18000    113167.55 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
---
GET       0.022         0.00
GET       0.025         0.00
GET       0.026         0.00
GET       0.027         0.00
GET       0.028         0.00
GET       0.029         0.00
GET       0.030         0.00
GET       0.031         0.00
GET       0.032         0.00
GET       0.033         0.00
GET       0.034         0.00
GET       0.035         0.00
GET       0.036         0.00
GET       0.037         0.01
GET       0.038         0.01
GET       0.040         0.01
GET       0.041         0.01
GET       0.042         0.01
GET       0.043         0.01
GET       0.044         0.01
GET       0.045         0.01
GET       0.046         0.01
GET       0.047         0.01
GET       0.048         0.01
GET       0.049         0.01
GET       0.050         0.01
GET       0.051         0.01
GET       0.052         0.01
GET       0.053         0.01
GET       0.054         0.01
GET       0.055         0.02
GET       0.056         0.02
GET       0.057         0.02
GET       0.058         0.02
GET       0.059         0.02
GET       0.060         0.02
GET       0.061         0.02
GET       0.062         0.02
GET       0.063         0.02
GET       0.064         0.02
GET       0.065         0.03
GET       0.066         0.03
GET       0.067         0.03
GET       0.068         0.03
GET       0.069         0.03
GET       0.070         0.03
GET       0.071         0.03
GET       0.072         0.03
GET       0.073         0.03
GET       0.074         0.04
GET       0.075         0.04
GET       0.076         0.04
GET       0.077         0.04
GET       0.078         0.04
GET       0.079         0.04
GET       0.080         0.04
GET       0.081         0.04
GET       0.082         0.05
GET       0.083         0.05
GET       0.084         0.06
GET       0.085         0.06
GET       0.086         0.06
GET       0.087         0.07
GET       0.088         0.07
GET       0.089         0.07
GET       0.090         0.08
GET       0.091         0.08
GET       0.092         0.08
GET       0.093         0.08
GET       0.094         0.08
GET       0.095         0.09
GET       0.096         0.09
GET       0.097         0.09
GET       0.098         0.09
GET       0.099         0.10
GET       0.100         0.13
GET       0.110         0.19
GET       0.120         0.34
GET       0.130         1.43
GET       0.140         4.90
GET       0.150         9.45
GET       0.160        20.70
GET       0.170        52.08
GET       0.180        73.33
GET       0.190        79.90
GET       0.200        84.73
GET       0.210        88.91
GET       0.220        92.78
GET       0.230        95.87
GET       0.240        97.07
GET       0.250        97.43
GET       0.260        97.58
GET       0.270        97.65
GET       0.280        97.71
GET       0.290        97.83
GET       0.300        98.14
GET       0.310        98.72
GET       0.320        99.39
GET       0.330        99.75
GET       0.340        99.89
GET       0.350        99.94
GET       0.360        99.96
GET       0.370        99.96
GET       0.380        99.96
GET       0.390        99.97
GET       0.400        99.97
GET       0.410        99.97
GET       0.420        99.97
GET       0.430        99.97
GET       0.440        99.98
GET       0.450        99.98
GET       0.460        99.98
GET       0.470        99.99
GET       0.480        99.99
GET       0.490        99.99
GET       0.500        99.99
GET       0.510        99.99
GET       0.520        99.99
GET       0.530        99.99
GET       0.540        99.99
GET       0.550        99.99
GET       0.560        99.99
GET       0.570        99.99
GET       0.580        99.99
GET       0.590        99.99
GET       0.600        99.99
GET       0.610        99.99
GET       0.620        99.99
GET       0.630        99.99
GET       0.640       100.00
GET       0.650       100.00
GET       0.660       100.00
GET       0.670       100.00
GET       0.680       100.00
GET       0.690       100.00
GET       0.700       100.00
GET       0.710       100.00
GET       0.740       100.00
GET       0.750       100.00
GET       0.770       100.00
GET       0.790       100.00
GET       0.800       100.00
GET       0.880       100.00
GET       0.890       100.00
GET       0.930       100.00
GET       1.100       100.00
GET       1.200       100.00
GET       1.300       100.00
GET       2.400       100.00
GET       2.500       100.00
---